Tekla Open API Reference for Tekla Structures 2025
MeshSelectionForm Properties
The MeshSelectionForm type exposes the following members.
Properties
Name | Description
Localization
 The localization instance for the dialog. Each dialog has its own localization instance that has read the localization files needed for that dialog.
 (Inherited from FormBase.)
SelectedMeshGrade
 The selected mesh grade.
SelectedMeshName
 The selected mesh name.
Top
See Also
Reference
MeshSelectionForm Class
Tekla.Structures.Dialog.UIControls Namespace